In [4]:
import pandas as pd
import numpy as np

In [12]:
people = {
    'first':['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
    'last':['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'],
    'email':['cshafer@gmail.com', 'JaneDoe@gmail.com','JohnDoe@gmail.com', None, 'Anonymous@email.com', np.nan, 'Missing'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [28]:
df = pd.DataFrame(people)

df.replace(['NA', 'Missing'], np.nan, inplace=True)

In [29]:
df

   first     last                email   age
0  Corey  Schafer    cshafer@gmail.com    33
1   Jane      Doe    JaneDoe@gmail.com    55
2   John      Doe    JohnDoe@gmail.com    63
3  Chris  Schafer                 None    36
4    NaN      NaN  Anonymous@email.com  None
5   None      NaN                  NaN  None
6    NaN      NaN                  NaN   NaN

In [15]:
df.dropna()

   first     last              email      age
0  Corey  Schafer  cshafer@gmail.com       33
1   Jane      Doe  JaneDoe@gmail.com       55
2   John      Doe  JohnDoe@gmail.com       63
6     NA  Missing            Missing  Missing

In [16]:
df

   first     last                email      age
0  Corey  Schafer    cshafer@gmail.com       33
1   Jane      Doe    JaneDoe@gmail.com       55
2   John      Doe    JohnDoe@gmail.com       63
3  Chris  Schafer                 None       36
4    NaN      NaN  Anonymous@email.com     None
5   None      NaN                  NaN     None
6     NA  Missing              Missing  Missing

In [17]:
df.dropna(how='all')

   first     last                email      age
0  Corey  Schafer    cshafer@gmail.com       33
1   Jane      Doe    JaneDoe@gmail.com       55
2   John      Doe    JohnDoe@gmail.com       63
3  Chris  Schafer                 None       36
4    NaN      NaN  Anonymous@email.com     None
6     NA  Missing              Missing  Missing

In [18]:
df

   first     last                email      age
0  Corey  Schafer    cshafer@gmail.com       33
1   Jane      Doe    JaneDoe@gmail.com       55
2   John      Doe    JohnDoe@gmail.com       63
3  Chris  Schafer                 None       36
4    NaN      NaN  Anonymous@email.com     None
5   None      NaN                  NaN     None
6     NA  Missing              Missing  Missing

In [21]:
df.dropna(how='any', subset=['email', 'last'])

   first     last              email      age
0  Corey  Schafer  cshafer@gmail.com       33
1   Jane      Doe  JaneDoe@gmail.com       55
2   John      Doe  JohnDoe@gmail.com       63
6     NA  Missing            Missing  Missing

In [22]:
df

   first     last                email      age
0  Corey  Schafer    cshafer@gmail.com       33
1   Jane      Doe    JaneDoe@gmail.com       55
2   John      Doe    JohnDoe@gmail.com       63
3  Chris  Schafer                 None       36
4    NaN      NaN  Anonymous@email.com     None
5   None      NaN                  NaN     None
6     NA  Missing              Missing  Missing

In [25]:
df['email'].value_counts()

Missing                1
JaneDoe@gmail.com      1
Anonymous@email.com    1
cshafer@gmail.com      1
JohnDoe@gmail.com      1
Name: email, dtype: int64

In [30]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [31]:
df['age'] = df['age'].astype(float)

In [32]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [33]:
df['age'].mean()

46.75

In [34]:
df['age'].median()

45.5